import 'dart:ffi';

import 'package:hooks_riverpod/hooks_riverpod.dart';

final contactsViewModelProvider = Provider<ContactsViewModel>((ref) {
  return ContactsViewModel(ref: ref);
});

class ContactsViewModel {
  ContactsViewModel({
    required this.ref,
  });

  final ProviderRef ref;

  final String churchHistoryKn = """
1935 ಮಾರ್ಚ್ 3 ವೆರ್ ಜೆಪ್ಪು-ಬಜಾಲ್ ಚಾಪ್ಲೆನ್ಸಿ ನಾಂವಾಂಖಾಲ್ ತವಳ್ಚಾ ಭಿಸ್ಪ್ ಅ| ಮಾ| ವಿಕ್ಟರ್ ಆರ್. ಫೆರ್ನಾಂದಾನ್ ಕಾಸ್ಸಿಯಾ ಫಿರ್ಗಜ್ ಸ್ಥಾಪಿಲಿ. 'ಕಾಸ್ಸಿಯಾ' ನಾಂವ್ ಘೆತಲ್ಲೆಂ ಉಪ್ರಾಂತ್. ರುಜಾಯ್ ಫಿರ್ಗಜೆ ಥಾವ್ನ್ 230 ಕುಟ್ಮಾ ವಿಂಗಡ್ ಕರ್ನ್ ಮಾ| ಫ್ರಾನ್ಸಿಸ್ ಸಾವೆರ್ ಫೆರ್ನಾಂದಾಕ್ ಪಯ್ಲೊ ಚಾಪ್ಲೆಯ್ನ್ ಜಾವ್ನ್ ಭಿಸ್ಪಾನ್ ನೇಮಕ್ ಕೆಲೊ.  ಜೂನ್ 1 ವೆರ್ 1935, ರುಜಾಯ್ ಕಾಥೆದ್ರಾಲಾಚೊ ತೆದ್ನಾಚೊ ವಿಗಾರ್ ಬೊ| ಮಾ| ಜೆ. ಎಲ್. ವಿ ಡಿ ಸೋಜಾ ಬಾಪಾನ್ ಪಯ್ಲೆಂ ಮೀಸ್ 'ಕಾಸ್ಸಿಯಾಂತ್' ಭೆಟಯ್ಲೆಂ. ಶ್ರೀಮತಿ ಎಮ್. ಎಮ್. ಲೋಬೊ ಆನಿ ದೆ| ಎ. ಜೆ. ಲೋಬೊಚಾ ವಿಂಗಡಚ್ ಉಬಾರ್ಲೆಲ್ಯಾ ಘರಾಂತ್ ಹೆಂ ಪಯ್ಲೆಂ ಮೀಸ್ ಭೆಟಯ್ಲೆಂ.

20-10-1935 ಆಲ್ತಾರ್ ಭುರ್ಗ್ಯಾಂಚಿ ಸೊಡೆಲಿಟಿ ಸ್ಥಾಪನ್ ಕೆಲಿ. ಫಿರ್ಗಜೆಂತ್ಲೊ ಹೊ ಪ್ರಥಮ್ ಸಂಘ್ ಸಂಸ್ಥೊ. ಉಪ್ರಾಂತ್ 24-11-1935ವೆರ್ ಮಾಗ್ಣ್ಯಾಚಾ ಆಪೋಸ್ತಲಾದಿಚೊ ಸಂಘ್ ಸ್ಥಾಪ್ಲೊ. ಮರಿಯೆಚಾ ಖಾತಾವಿಣ್ ಕಾಳ್ಜಾಚೊ ದಾದ್ಲ್ಯಾಂಚೊ ಸಂಘ್ 1936 ದಸೆಂಬರ್ 15 ವೆರ್ ಆನಿ ಮಾರ್ಚ್ 14, 1937 ಇಸ್ವೆಂತ್ ಸಾಂ. ವಿಶೆಂತ್ ಪಾವ್ಲ್ ಸಭಾ ಸ್ಥಾಪನ್ ಕೆಲ್ಯೊ.

ಕಾಸ್ಸಿಯಾಂತ್ ಪಯ್ಲಿ ಗೊವ್ಳಿಕ್ ಭೆಟ್ 1937 ಆಕ್ಟೊಬರ್ 3 ವೆರ್ ಜಾಲಿ. ತ್ಯಾ ದಿಸಾ ಭಿಸ್ಪಾನ್ 220 ಭುರ್ಗ್ಯಾಂಕ್ ಥಿರಾವ್ಣೆಚೊ ಸಂಸ್ಕಾರ್ ದಿಲೊ.

1939 ದಸೆಂಬರ್ 15 ವೆರ್ ಇಗರ್ಜೆ ಬಾಂದ್ಪಾಚೊ ಬುನ್ಯಾದೆ ಫಾತೊರ್ ಆಶೀರ್ವಾದಿತ್ ಕರುಂ ಇಗರ್ಜೆ ಬಾಂದ್ಪಾಚೊ ವಾವ್ರ್ ಸುರು ಕೆಲೊ. 1942 ಫೆಬ್ರೆರ್ 8 ಆನಿ 9 ವೆರ್ ಭಿಸ್ಪಾಚಿ ದುಸ್ರಿ ಗೊವ್ಳಿಕ್ ಭೆಟ್ ಜಾಲಿ ಆನಿ 211 ಭುರ್ಗ್ಯಾಂಕ್ ಥಿರಾವ್ಣೆಚೊ ಸಂಸ್ಕಾರ್ ಲಾಬ್ಲೊ.

ದುಡ್ವಾಚಾ ಅಭಾವಾನ್ ಇಗರ್ಜೆ ಬಾಂದ್ಪಾಚೊ ವಾವ್ರ್ ಸವ್ಕಾಸಾಯೆನ್ ಚಲ್ಲೊ. 2% ವಾಡಿರ್ ಲೊಕಾ ಥಾವ್ನ್ ರೀಣ್ ಘೆವ್ನ್ ಫೆರ್ನಾಂದ್ ಬಾಪಾಬ್ ಬಾಂದ್ಪಾಚೊ ವಾವ್ರ್ ಚಾಲು ದವರ್ಲೊ. 1942 ನವೆಂಬರ್ 22 ವೆರ್ ಭಿಸ್ಪ್ ಅ| ಮಾ| ದೊತೊರ್ ವಿತೊರ್ ಆರ್ ಫೆರ್ನಾಂದಾನ್ ಇಗರ್ಜ್ ಉಗ್ತಾವ್ನ್ ಆಶೀರ್ವಾದಿತ್ ಕೆಲಿ.

ಫಿರ್ಗಜೆಚೆಂ ಪಯ್ಲೆಂ ವ್ಹಡ್ಲೆಂ ಫೆಸ್ತ್ 1942 ನವೆಂಬರ್ 28 ವೆರ್ ಸಂಭ್ರಮಾನ್ ಆಚರಣ್ ಕೆಲೆಂ.

ಭಿಸ್ಪಾಚಾ ಅಧಿಕೃತ್ ಆದೇಶಾಖಾಲ್ 1943 ದಸೆಂಬರ್ 28ವೆರ್ ಬಜಾಲ್ ಫಿರ್ಗಜ್ ಸ್ಥಾಪ್ಲಿ. ತೆದ್ನಾ ಕಾಸ್ಸಿಯಾ ಫಿರ್ಗಜೆಚಿಂ 49 ಕುಟ್ಮಾ ಆಸ್ಚೊ ಏಕ್ ವಾಡೊ ಬಜಾಲ್ ಫಿರ್ಗಜೆಕ್ ಸೊಡ್ನ್ ದಿಲೊ.

ಎದೊಳ್ ಪರ್ಯಾಂತ್ ಬಾಪ್ ಫ್ರಾನ್ಸಿಸ್ ಸಾವೆರ್ ಫೆರ್ನಾಂದ್ ಕಾಸ್ಸಿಯಾಚೊ ಚಾಪ್ಲೇಯ್ನ್ ಜಾವ್ನಾಸಲ್ಲ್ಯಾ ತಾಕಾ ಭಿಸ್ಪಾನ್ 1947 ಫೆಬ್ರೆರ್ 3ವೆರ್ ಕಾಸ್ಸಿಯಾ ಸಾಂ. ರಿತಾ ಫಿರ್ಗಜೆಚೊ ವಿಗಾರ್ ಜಾವ್ನ್ ನೇಮಕ್ ಕೆಲೊ.

1949 ಫೆಬ್ರೆರ್ 4ವೆರ್ ಸಾಂ. ರಿತಾಚಿ ಫಿರ್ಗಜ್ ಫಾತಿಮಾ ಮಾಯೆಕ್ ಸಮರ್ಪಿಲಿ (ಕೊನ್ಸೆಕ್ರಾರ್ ಕೆಲಿ). ತೆದ್ನಾ ಫಾತಿಮಾ ಸಾಯ್ಬಿಣಿಚಿ ಇಮಾಜ್ ಸಂಭ್ರಮಾನ್ ಇಗರ್ಜೆಕ್ ಹಾಡ್ಲಿ. 2000 ಲೊಕಾನಿ ಜಳ್ತ್ಯೊ ವಾತಿ ಘೆವ್ನ್ ಪುರ್ಶಾಂವ್ ಕಾಡ್ಲೊ.

ತ್ಯಾಚ್ ವರ್ಸಾ ಇಗರ್ಜೆಚಾ ಮುಕ್ಲ್ಯಾ ತೊರಿ (façade) ಚೆರ್ ದವರಲ್ಲಿ ಸಾಂ. ರಿತಾಚಿ ಇಮಾಜ್ (ರು. 200 ಮೊಲಾಚಿ) ಶ್ರೀ. ಪಿ. ವಿ. ರಸ್ಕಿನ್ಹಾನ್ ದಾನ್ ದಿಲ್ಲೆಲಿ. ಸಾಂಗಾತಾಚ್ ಶ್ರೀ. ಜೊನ್ ವಿನ್ಸೆಂಟ್ ರೋಚ್ ಹಾಣೆಯ್ ಸಾಂ. ವಿಶೆಂತ್ ಪಾವ್ಲಾಚಿ ಇಮಾಜ್ (ರು.200) ದಾನ್ ದಿಲಿ.

1950 ನವೆಂಬರಾಂತ್ ಸಾಂ. ರಿತಾಕ್ ಸಾಂತಿಣ್ ಮ್ಹಣ್ ಪಾಚಾರ್ಲೆಲ್ಲ್ಯಾ ಪನ್ನಾಸಾವೊ ಭಾಂಗ್ರಾಳೊ ಉತ್ಸವ್ ಸಂಭ್ರಮಾನ್ ಆಚರಣ್ ಕೆಲೊ. ತ್ಯಾ ವೆಳಾರ್ ಇಗರ್ಜೆ ವೊಣ್ತಿ ವಯ್ಲೆ ಕೊಂಕ್ರಿಟ್ ವೆಂಟಿಲೆಟರ್ಸ್ (ಜನೆಲಾಂ) ತಯಾರ್ ಕರ್ನ್ ಬಸಯ್ಲಿಂ.

ಆತಾಂ ಆಸ್ಚಿ ಸಾಗೊಣಿ ರುಕಾಚಿ ಸಾಂ. ರಿತಾಚಿ ಬ್ರಹತ್ ಆಲ್ತಾರ್ 1957 ಇಸ್ವೆಂತ್ ರು. 10,000 ಖರ್ಚಾರ್ ತಯಾರ್ ಕೆಲಿ. ತ್ಯಾ ದಿಸಾ 2370 ಲೊಕಾಕ್ ಗಡ್ದ್ ಜೆವಾಣ್ ವಾಡ್ಲೆಂ.

1959 ಅಗೋಸ್ತ್ 30ವೆರ್ ರು. 15,000 ಖರ್ಚಾರ್ ಫಿರ್ಗಜೆಚೆಂ ಸಭಾ ಸಾಲ್ ಉಗ್ತಾಯ್ಲೆಂ. ತ್ಯಾಚ್ ದಿಸಾ ಇಗರ್ಜೆ ಮುಕ್ಲ್ಯಾ ತೊರಿರ್ ಏಕ್ಯೆ ಕುಶಿನ್ ಸಾಂ. ಪೆದ್ರುಚಿ ಆನ್ಯೇಕಾ ಕುಶಿನ್ ಸಾಂ. ಪಾವ್ಲಾಚಿ ಇಮಾಜ್ಯೊ ಅ| ಮಾ| ದೊತೊರ್ ಬಿಸ್ಪ್ ಡಿಮೆಲ್ಲೊನ್ ಆಶೀರ್ವಾದಿತ್ ಕೆಲ್ಯೊ. ಸಾಂ. ಜುಜೆ ವಾಡ್ಯಾಚಾ ಜೋಕಿಮ್ ಪಿಂಟೊನ್ ಹ್ಯೊ ಇಮಾಜಿ ದಾನ್ ದಿಲ್ಲ್ಯೊ. 

1960 ಇಸ್ವೆಚಾ ನವೆಂಬರಾಂತ್ ಸಾಂ. ರಿತಾಕ್ ಸಾಂತಿಣ್ ಮ್ಹಣ್ ಪಾಚಾರುನ್ ಸಾಟ್ ವರ್ಸಾಂ ಸಂಪ್ಲೆಲ್ಲ್ಯಾಚೊ  (1900-1960) ವಜ್ರಾಳೊ ಉತ್ಸವ್ ಆನಿ ಕಾಸ್ಸಿಯಾ ಫಿರ್ಗಜ್ ಸ್ಥಾಪನೆಚೊ ರುಪ್ಯಾಳೊ ಉತ್ಸವ್ (1935-1960) ಸಾಂಗಾತಾ ಗದ್ದಾಳಾಯೆನ್ ಆಚರಣ್ ಕೆಲೊ. ಫಿರ್ಗಜ್ಗಾರಾಂಕ್ ಮಾತ್ರ್ ನೈ, ಆಸ್ಪಾಸ್ಚಾ ಲೊಕಾಕ್ ಮೆಳುನ್ 4089 ಲೊಕಾಕ್ ಜೆವಾಣ್ ವಾಡ್ಲೆಂ. ತ್ಯಾಚ್ ವರ್ಸಾ ನವೆಂಬರಾಂತ್ ಫಿರ್ಗಜೆಚಾ ಕೊಂಪ್ರಿಚಾ ಫೆಸ್ತಾಕ್ ಫಿರ್ಗಜೆಚೊ ಪ್ರಥಮ್ ಯಾಜಕ್ ವಿಲಿಯಂ ಡಿಮೆಲ್ಲೊನ್ ಸಂಭ್ರಮಿಕ್ ಮೀಸ್ ಭೆಟಯ್ಲೆಂ. ತವಳ್ ತೊ ಬೆಂಗ್ಳುರ್ ಚಾ ಸಾಂ. ಪ್ಯಾಟ್ರಿಕ್ ಫಿರ್ಗಜೆಚೊ ಸಹಾಯಕ್ ಯಾಜಕ್ ಜಾವ್ನಾಸ್ಲೊ.

1963 ಅಗೋಸ್ತಾಂತ್ ರು. 5000 ಖರ್ಚಾರ್ ಲೂರ್ದ್ ಮಾಯೆಚೊ ಗ್ರೊಟ್ಟೊ ಉಬಾರ್ಲೊ.

1965 ಅಗೋಸ್ತ್ 19 ಇಗರ್ಜೆಚಾ ಘಾಂಟಿಚಾ ತೊರಿಚೊ ಬುನ್ಯಾದೆ ಫಾತೊರ್ ಅ| ಮಾ| ದೊ| ಭಿಸ್ಪ್ ಬಾಜಿಲ್ ಸೊಜಾನ್ ಆಶೀರ್ವಾದಿತ್ ಕೆಲೊ. ರು.23,000 ಖರ್ಚಾರ್ ಹಿ ತೋರ್ ಉಬಾರ್ಲಿ ಆನಿ 28-11-1965 ಕೊಂಪ್ರಿಚಾ ಆಯ್ತಾರಾ ತಿ ಉಗ್ತಾಯ್ಲಿ.

ಕಾಸ್ಸಿಯಾ ಫಿರ್ಗಜೆಚೊ ಪ್ರಥಮ್ ವಿಗಾರ್ ಫ್ರಾನ್ಸಿಸ್ ಸಾವೆರ್ ಫೆರ್ನಾಂದಾಕ್ "ಪಾಪಾಲ್ ಚಾಪ್ಲೆಯ್ನ್" ಬಿರುದ್ 1968ತ್ ಲಾಬ್ಲೆಂ. ತವಳ್ ತೊ ಅಸ್ವಸ್ತ್ ಆಸ್ಲೊ. ಕಂಕನಾಡಿ ವಿಯಾನ್ನಿ ಘರಾಂತ್ ತೊ 1968 ಮೇ 5 ಥಾವ್ನ್ ಮೇ 21, 1969 ಪರ್ಯಾಂತ್ ಆಸ್ಲೊ. ಮೇ 21 ವೆರ್ ತೊ ಮತಿಹೀನ್ (coma) ಜಾಲೊ ಆನಿ ಜೂನ್ 23 ವೆರ್ ರಾತಿಂ 10:30 ವರಾರ್ ಅಂತರ್ಲೊ. 1969 ಜೂನ್ 24ವೆರ್ ತಾಚಿ ನಿರ್ಜೀವ್ ಕೂಡ್ ಕಾಸ್ಸಿಯಾ ಇಗರ್ಜೆಕ್ ಹಾಡ್ಲಿ. ಭಿಸ್ಪ್ ಬಾಜಿಲ್ ಸೊಜಾನ್ ಸಾಂಜೆರ್ 5:00 ವರಾರ್ ಮೀಸ್ ಭೆಟವ್ನ್ ಶೆರ್ಮಾಂವ್ ದಿಲೊ. ಉಪ್ರಾಂತ್ ಪುರ್ಶಾಂವಾರ್ ರೈಲ್ವೆ ದುಸ್ರೊ ಸಾಂಖೊ (ಇಗರ್ಜೆ ಮುಕ್ಲೊ), ಮಾರ್ನೆಮಿಕಟ್ಟ, ಕಾಸ್ಸಿಯಾ ಇಸ್ಕೊಲ್, ಜೆಪ್ಪು ಮಾರ್ಕೆಟಿಂತ್ಲ್ಯಾನ್ ಮೊರ್ಗನ್ಸ್ ಗೇಟ್ ಮುಖಾಂತ್ರ್ ಇಗರ್ಜೆಕ್ ಹಾಡ್ನ್ ತಾಕಾ ಇಗರ್ಜೆ ಭಿತರ್ ನಿಕೆಪಿಲೊ.
""";

  final String churchHistory = "History is";

  final List<String> churchImages = [
    'history1.png',
    'history2.jpg',
  ];
}
